doc/html/elements/inplace.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>General In-Place Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="General In-Place Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:25:23 CDT"/>
<meta name="author" content="Milan Svoboda"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">General In-Place Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 General In-Place Element - #inplace {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General In-Place Element - #inplace {}</h2>
<div class="outline-text-2" id="text-1">


<p>
  The inplace element creates a view element that the user can edit in place.
</p>
<p>
  The user clicks on the view element, and it is replaced with an edit
  element, an OK button, and a Cancel button. 
</p>
<p>
  If the user clicks OK, a callback is issued to the delegate module
  so that it can save the new value.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">inplace</span> { id=textbox1, text=<span class="org-string">"Some text."</span>, view=#<span class="org-type">span</span>{}, edit=#<span class="org-type">textbox</span>{} }.

#<span class="org-type">inplace</span> { id=textbox2, text=<span class="org-string">""</span>, view=#<span class="org-type">image</span>{}, edit=#<span class="org-type">textbox</span>{} }.

<span class="org-variable-name">Dropdown</span> = #<span class="org-type">dropdown</span>{options=[#<span class="org-type">option</span>{value=<span class="org-string">"option1"</span>, text=<span class="org-string">"Option 1"</span>},
                              #<span class="org-type">option</span>{value=<span class="org-string">"option2"</span>, text=<span class="org-string">"Option 2"</span>},
                              #<span class="org-type">option</span>{value=<span class="org-string">"option3"</span>, text=<span class="org-string">"Option 3"</span>} ]},
#<span class="org-type">inplace</span> { id=textbox3, text=<span class="org-string">"option2"</span>, view=<span class="org-variable-name">Dropdown</span>#<span class="org-type">dropdown</span>{actions=#<span class="org-type">disable</span>{}}, edit=<span class="org-variable-name">Dropdown</span> }.
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>view - (<i>Erlang term</i>)</dt><dd>View element.

</dd>
<dt>edit - (<i>Erlang term</i>)</dt><dd>Edit element.

</dd>
<dt>text - (<i>string</i>)</dt><dd>Set the view element's contents.

</dd>
<dt>start_mode - (<i>Atom</i>, 'edit' or 'view')</dt><dd>Set whether the textbox should start in edit mode or view mode.

</dd>
<dt>tag - (<i>Erlang term</i>)</dt><dd>See the delegate attribute for details.

</dd>
<dt>delegate - (<i>Atom</i>)</dt><dd>Name of the module to call inplace_event(Tag, Value).
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Callbacks</h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4"></span> inplace_event(Tag, Value)</h4>
<div class="outline-text-4" id="text-1-3-1">


<p>
    Called when the user presses the OK button. Tag is specified in
    the 'tag' attribute, above.  Value is the current value of the
    textbox. This callback function should process the value as
    necessary, and must return either the value itself, or a new value
    that will be sent back to the page and set as the value of the
    textbox.
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-4">


<ul>
<li><a href="./base.html">base element</a>

</li>
<li><a href="./inplace_textarea.html">inplace<sub>textarea</sub> element</a>

</li>
<li><a href="./inplace_textbox.html">inplace<sub>textbox</sub> element</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:25:23 CDT</p>
<p class="author">Author: Milan Svoboda</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/inplace.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
